esp-mosaico/esp-mosaico-bsp/examples/esp32a1_recorder/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Keep the native USB Serial/JTAG port alive after the ROM downloader hands
# control to the application, and route ESP_LOG output to that port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# CO5300 display with touchscreen controls.
CONFIG_BSP_DISPLAY_ENABLE=y
CONFIG_BSP_CO5300_ENABLE_TE=y

# LVGL buffers are allocated from PSRAM by esp_lvgl_adapter.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# Match the LVGL 9.5 configuration used with esp_lvgl_adapter 0.6.2.
# Allocate the recording list dynamically instead of exhausting a 64 KB LVGL pool.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_ASSERT_HANDLER_INCLUDE="assert.h"

# The NAND logical page is the LittleFS read/program/cache unit.
CONFIG_LITTLEFS_CACHE_SIZE=2048
# Cover the whole ~60k-page NAND allocation bitmap; avoid tiny-window rescans.
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=8192
